In [16]:
import pandas as pd
import numpy as np

In [17]:
map = {
    "name": ["friendA", "friendB", "friendC", "friendD"],
    "marks": [100, 99, 33, 10],
    "city": ["hyderabad", "pune", "vijaywada", "un"]
}

In [18]:
df = pd.DataFrame(map)

In [19]:
df

      name  marks       city
0  friendA    100  hyderabad
1  friendB     99       pune
2  friendC     33  vijaywada
3  friendD     10         un

In [20]:
df.to_csv('test.csv', index=False)

In [21]:
df.head(1)

      name  marks       city
0  friendA    100  hyderabad

In [22]:
df.tail(1)

      name  marks city
3  friendD     10   un

In [23]:
df.describe()

            marks
count    4.000000
mean    60.500000
std     46.003623
min     10.000000
25%     27.250000
50%     66.000000
75%     99.250000
max    100.000000

In [24]:
df = pd.read_csv('trains.csv')

In [25]:
df

   Train No  Speed       City
0     82398     70      delhi
1     72391     50     mumbai
2     61280    100  hyderabad
3     19842     80    kolkata

In [26]:
df.loc['Speed', '0'] = 65

C:\Users\kusha\AppData\Local\Temp\ipykernel_15060\3773118756.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Speed']['0'] = 65

In [27]:
df

   Train No  Speed       City
0     82398     70      delhi
1     72391     50     mumbai
2     61280    100  hyderabad
3     19842     80    kolkata